<!-- создаем компанент кнопки  -->
<template>
  <!-- далее создаем кнопку и добавляем ей кастомное событие которое будет слушать родительский блок и добавляем обший клас активности и через директиву v bind получаем props от родительского компанета -->
  <button @click="$emit('action')" class="btn" :class="color">
    <!-- встроеный тег slot позволяем записывать контент внутри тега, а не передавать этот параметр в качестве props  -->
    <slot></slot>
  </button>
</template>

<script>
export default {
  emits: ["action"], //валидируем событие которое хотим отдать родителю
  props: {
    color: {
      //валидируем что хотим получить от родительского компанента
      type: String,
      default: "",
      valiator(value) {
        //через валидаро указываем что мы хотим получить от родителя и через метод includes проверяем что бы мы получали только эти элементы
        return ["", "primary", "danger"].includes(value);
      },
    },
  },
};
</script>
